# FrozenBecauseFaceGone Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FrozenBecauseFaceGone Property
BuiltInFailures..::..FamilyFailures Class See Also
---
This family instance was hosted by a curved face that is no longer present in the linked file. To move the family instance, rehost it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FrozenBecauseFaceGone { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FrozenBecauseFaceGone As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FrozenBecauseFaceGone {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace